using UnityEngine;
using System.Collections;

public class AutoFuncExecute : MonoBehaviour {

//========================================================================================
// 定数
//========================================================================================
	
	
//========================================================================================
// 変数
//========================================================================================
	//--public----------------------
	
	//--pirvate---------------------
	private float m_timeCounter;
	private float m_deleteTime;
	
//========================================================================================
// プロパティ。イベント
//========================================================================================
	public delegate void ExecuteFuncWithDeleteEventHandler();
	public ExecuteFuncWithDeleteEventHandler executeFuncWithDestory;
	
//========================================================================================
// 関数
//========================================================================================
	//--------------------------------------------------------
	// 初期化処理
	//--------------------------------------------------------
	void Start () 
	{
		m_timeCounter = 0.0f;
	}
	
	//--------------------------------------------------------
	// 更新処理
	//--------------------------------------------------------
	void Update () 
	{
		// 死亡時間になったら削除
		m_timeCounter += Time.deltaTime;
		if(m_deleteTime < m_timeCounter)
		{
			executeFuncWithDestory();
			Destroy(this.gameObject);
		}
	}

	//--------------------------------------------------------
	// 死亡時刻等のセット
	//--------------------------------------------------------
	public void SetDeleteTimeAndExecuteFunc (float time, ExecuteFuncWithDeleteEventHandler func)
	{
		m_deleteTime = time;
		executeFuncWithDestory = func;
	}
}
