//========================================================================================
//
// 製作者 : 大榮圭祐
//
//========================================================================================

using UnityEngine;
using System.Collections;

public class KillLine : MonoBehaviour {
	//========================================================================================
	// 定数
	//========================================================================================
	
	
	//========================================================================================
	// 変数
	//========================================================================================
	//--public----------------------
	
	
	//--pirvate---------------------
	

	//========================================================================================
	// プロパティ。イベント
	//========================================================================================
	public delegate void CollisionWithBallEventHandler();
	public event CollisionWithBallEventHandler OnCollidesWithBall;


	//========================================================================================
	// 関数
	//========================================================================================
	//--------------------------------------------------------
	// 初期化処理
	//--------------------------------------------------------
	void Start () 
	{
		
	}
	
	//--------------------------------------------------------
	// 更新処理
	//--------------------------------------------------------
	void Update () 
	{
		
	}

	//--------------------------------------------------------
	// 衝突時処理
	//--------------------------------------------------------
	private void OnTriggerEnter2D(Collider2D other)
	{
		Debug.Log("KillLineが" + other.gameObject.tag + "と衝突");

		// 壁だったら何もしない
		if (other.gameObject.tag == "Wall") return;
		
		// ボールだったら
		if (other.gameObject.tag == "Ball")
		{
			// ボール破壊時のエフェクトを表示
			GameObject effect = Instantiate( Resources.Load( @"Prefabs/Particles/DethParticle" ) ) as GameObject;
			effect.transform.parent = this.transform;
			effect.transform.position = new Vector2( -0.0f, -8.0f );
			
			// イベントハンドラを呼び出す
			if (OnCollidesWithBall != null) this.OnCollidesWithBall();
		}
		
		// 触れたオブジェクトを削除
		Destroy(other.gameObject);
		Debug.Log("削除対象オブジェクトであったため、KillLineはオブジェクトを削除");
	}
}
